Revit 2027 API
IFCCategoryTemplate.SetMappingInfo(ExportIFCCategoryKey, ExportIFCCategoryInfo) Method
 Set the mapping info for the key.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetMappingInfo(
	ExportIFCCategoryKey key,
	ExportIFCCategoryInfo info
)
Public Sub SetMappingInfo (
	key As ExportIFCCategoryKey,
	info As ExportIFCCategoryInfo
)
public:
void SetMappingInfo(
	ExportIFCCategoryKey^ key,
	ExportIFCCategoryInfo^ info
)
member SetMappingInfo :
        key : ExportIFCCategoryKey *
        info : ExportIFCCategoryInfo -> unit
Parameters
key ExportIFCCategoryKey
 The key.
info ExportIFCCategoryInfo
 The info.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCCategoryTemplate Class
SetMappingInfo Overload
Autodesk.Revit.DB Namespace